Revit 2026 API

# AnalysisDisplayColorEntry Methods

---

The AnalysisDisplayColorEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasValue | Check if color entry has associated value. |
|  | IsEqual | Compare color entries. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

AnalysisDisplayColorEntry Class

Autodesk.Revit.DB.Analysis Namespace